# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример1: [2, 3, 4, 5, 6] => [12, 15, 16];
# Пример1: [2, 3, 5, 6] => [12, 15]

my_list = [2, 3, 4, 5, 6]
new_list = []
for item in range((len(my_list) + 1) // 2):
    new_list.append(my_list[item] * my_list[-item-1])
print(new_list)   